{
  "model_type": "bart",
  "pad_token": "<pad>",
  "bos_token": "<s>",
  "eos_token": "</s>",
  "unk_token": "<unk>",
  "mask_token": "<mask>",
  "sep_token": "</s>",
  "cls_token": "<s>",
  "max_position_embeddings": 1024,
  "vocab_size": 50265,
  "encoder_layers": 12,
  "decoder_layers": 12,
  "encoder_attention_heads": 16,
  "decoder_attention_heads": 16,
  "encoder_ffn_dim": 4096,
  "decoder_ffn_dim": 4096,
  "d_model": 1024,
  "dropout": 0.1,
  "attention_dropout": 0.1,
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "init_std": 0.02,
  "scale_embedding": false,
  "normalize_before": false,
  "normalize_embedding": true,
  "static_position_embeddings": false,
  "add_final_layer_norm": false,
  "do_blenderbot_90_layernorm": false,
  "use_cache": true,
  "forced_bos_token_id": 0,
  "forced_eos_token_id": 2,
  "encoder_layerdrop": 0.0,
  "decoder_layerdrop": 0.0,
  "extra_pos_embeddings": 2,
  "num_beams": 4,
  "length_penalty": 2.0,
  "early_stopping": true,
  "use_return_dict": true,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": 0,
  "forced_eos_token_id": 2,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "no_repeat_ngram_size": 3,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "chunk_size_feed_forward": 0,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": 0,
  "forced_eos_token_id": 2,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "no_repeat_ngram_size": 3,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "chunk_size_feed_forward": 0
} 